1. ¿Qué diferencia hay entre una Serie y un DataFrame?

Que la serie tiene una dimensión y el DataFrame tiene dos dimensiones.

2. Momento de trabajar con Series. Contesta a las siguientes preguntas:

In [2]:
import pandas as pd

In [1]:
valores= [3, 8, 4, 9, 2, 1, 7]

In [3]:
indices= ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]

In [4]:
pd.Series(valores, indices)

lunes        3
martes       8
miercoles    4
jueves       9
viernes      2
sabado       1
domingo      7
dtype: int64

In [7]:
resultados= zip (indices, valores)
resultados
print (list(resultados))

[('lunes', 3), ('martes', 8), ('miercoles', 4), ('jueves', 9), ('viernes', 2), ('sabado', 1), ('domingo', 7)]

In [8]:
lista_resultados = (list(resultados))

In [11]:
diccionario = {}

for keys, values in zip (indices, valores):
    diccionario [keys] = values

In [12]:
diccionario

{'lunes': 3,
 'martes': 8,
 'miercoles': 4,
 'jueves': 9,
 'viernes': 2,
 'sabado': 1,
 'domingo': 7}

Crea una Serie a partir del diccionario.

In [14]:
Serie_diccionario =pd.Series (diccionario)

In [15]:
Serie_diccionario

lunes        3
martes       8
miercoles    4
jueves       9
viernes      2
sabado       1
domingo      7
dtype: int64

In [16]:
Serie_diccionario.shape

(7,)

In [17]:
Serie_diccionario.dtype

dtype('int64')

In [18]:
Serie_diccionario.size

7

In [19]:
Serie_diccionario.index

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

In [20]:
Serie_diccionario.values

array([3, 8, 4, 9, 2, 1, 7])

In [21]:
Serie_diccionario["lunes"]

3

In [24]:
Serie_diccionario[0:3]

lunes        3
martes       8
miercoles    4
dtype: int64

In [30]:
Serie_diccionario [0::6]

lunes      3
domingo    7
dtype: int64

In [69]:
import numpy as np

3. Es el turno de los DataFrames

In [46]:
paises= np.random.randint(0, 50, (4,3))

paises

array([[46, 37, 16],
       [23, 19,  0],
       [29, 13, 41],
       [36, 10, 29]])

In [54]:
df= pd.DataFrame(paises)

In [56]:
df.columns = ["España", "Francia", "Italia"]

df

   España  Francia  Italia
0      46       37      16
1      23       19       0
2      29       13      41
3      36       10      29

In [73]:
df_medallas= pd.read_csv("medallas.csv", index_col=1)
df_medallas

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [75]:
df_medallas.drop(columns=["Unnamed: 0"], inplace= True)
df_medallas

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

In [74]:
df_medallas.loc["Tailandia",:]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

In [ ]:
df.insert[5, "Total"]